In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
--https://www.youtube.com/watch?v=0uBirYFhizE

In [4]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [5]:
ufo_cols = ['city', 'colors reported' , 'shape reported', 'state','time']

In [6]:
ufo.columns = ufo_cols

In [7]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [8]:
ufo.columns

Index(['city', 'colors reported', 'shape reported', 'state', 'time'], dtype='object')

In [9]:
ufo_cols = ['Cidades', 'Cores' , 'Shape', 'UF','Data Hora']

In [10]:
ufo.columns = ufo_cols

In [11]:
ufo.head()

                Cidades Cores     Shape  UF        Data Hora
0                Ithaca   NaN  TRIANGLE  NY   6/1/1930 22:00
1           Willingboro   NaN     OTHER  NJ  6/30/1930 20:00
2               Holyoke   NaN      OVAL  CO  2/15/1931 14:00
3               Abilene   NaN      DISK  KS   6/1/1931 13:00
4  New York Worlds Fair   NaN     LIGHT  NY  4/18/1933 19:00